run/planeXFlowBenchMark/fuel/constant/fuelProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu      [0 2 -1 0 0 0 0]     1.53e-4;
rho             rho     [1 -3 0 0 0 0 0]     0.255;

Cp              Cp      [0 2 -2 -1 0 0 0]    1.6731e3;
k               k       [1 1 -3 -1 0 0 0]    0.08;

gamma           gamma   [1 -1 -1 0 0 0 0]    4.781e-5;


// ************************************************************************* //
