run/planeXFlowBenchMark/fuel/0/k
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          k;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 1 -3 -1 0 0 0];       // thermal conductivity k [w/mK]

internalField   uniform 0.08;

boundaryField
{
    fuelInlet
    {
        type            zeroGradient;
    }

    fuelOutlet
    {
        type            zeroGradient;
    }

    fuelSides
    {
        type            zeroGradient;
    }

    anode
    {
        type            regionCoupling;
	value           uniform 0.0;
	remoteField     k;
    }

    upperInterconnect
    {
        type            regionCoupling;
	value           uniform 0.0;
	remoteField     k;
    }
}


// ************************************************************************* //
